Lavaro33/Nixie-clock/37_METEO_RX_ATmega88/nRF24L01/nRF24L01.c
/*                  e-gadget.header
 * nRF24L01.c
 *
 *  Created on: 
 *    Modyfied: 2015-04-13 21:18:47
 *      Author: Nefarious19
 *
 * Project name: "NRF24"
 *
 *	This is AVR GCC library for nRF24L01 module, ver. 1.0
 *	It can be only used by REGISTERED USERS of www.forum.atnel.pl, 
 *	they must only leave this header in they C code.
 *	
 *	Library code was written on the basis of:
 *	
 *	https://www.sklep.atnel.pl/pl/p/AVR-Microcontrollers-C-Programming-Basics-EN-BOOK-DVD/103
 *	https://www.sklep.atnel.pl/pl/p/Jezyk-C-Pasja-programowania-mikrokontrolerow-8-bitowych-Wydanie-II-Ksiazka-DVD/104
 *	
 *	"
 *	
 *	This library uses also some ideas from:
 *	
 *	http://gizmosnack.blogspot.com/2013/04/tutorial-nrf24l01-and-avr.html
 *	http://www.tinkerer.eu/AVRLib/nRF24L01/
 *
 *
 */

#include "nRF24L01.h"
#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>
#include <string.h>
#include <avr/pgmspace.h>

//#include "usart.h"

#include "nRF24L01_memory_map.h"
#include "SPI.h"

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// declarations of internal tool functions
//..................................................................................................................
void nRF_Read_Registers( uint8_t register_name, uint8_t * buffer_for_registers_content, uint8_t length_of_content );  //reads given ammount of bytes from choosen register
void nRF_Write_Register( uint8_t register_name, uint8_t * buffer_for_registers_content, uint8_t length_of_content ); //writes given ammount of bytes to choosen register
void nRF_Set_Active_DataPipe_And_ACK (uint8_t DataPipe, uint8_t on_or_off, uint8_t ACK_on_or_off );					 //This function is used to set active payload/payloads and enable/disable ACK functions
void nRF_Set_PAYLOAD_Width ( uint8_t payload, uint8_t width );  													 //this function is used to set payload length. Use this function if dynamic payload length is disabled
void nRF_Set_Dynamic_Payload_State_On_Data_Pipe(uint8_t data_pipe_number, uint8_t on_off ); 						 //this function is used to set
void nRF_Set_Data_Speed_And_Reciver_Power(uint8_t Data_rate, uint8_t power);                                         //this function is used to set transmission speed and reciver power
void nRF_Set_State_And_Width_Of_CRC( uint8_t one_or_two_bytes , uint8_t on_or_off);                                  //this function is used to set CRC state and width.
//__________________________________________________________________________________________________________________


//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// declaration of global variables which stores values depending on the transmission states
//..................................................................................................................
volatile uint8_t TX_flag;   //data sent event flag
volatile uint8_t RX_flag;   //data ready event flag
//..................................................................................................................
volatile uint8_t disable_dynamic_payload;
volatile uint8_t payload_width;
volatile uint8_t first_time = 0;
volatile uint8_t set_first_time_into_RX_MODE_after_TX_MODE = 0;
//__________________________________________________________________________________________________________________



//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// declaration of the buffer which stores incoming payloads data
//..................................................................................................................
uint8_t nRF_RX_bufffer[MAXIMUM_PAYLOAD_SIZE+1]; //reciver buffer
//__________________________________________________________________________________________________________________

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// callback function declaration
//........................................................................................................................
static void ( * nRF_RX_Event_Callback ) ( void * nRF_RX_buff , uint8_t len );
//________________________________________________________________________________________________________________________


//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function which is used to register your own callback function
//........................................................................................................................
void register_nRF_RX_Event_Callback ( void ( * callback )( void * nRF_RX_buff , uint8_t len ) )
{
	nRF_RX_Event_Callback = callback; //in this line we give an addres to our callback function
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// recived data event function
//........................................................................................................................
void nRF_RX_EVENT (void)
{
#if USE_IRQ == 0
	if ( nRF_Data_Ready() )  RX_flag = 1;
	else RX_flag = 0;
#endif

	if(set_first_time_into_RX_MODE_after_TX_MODE == 1)
	{
		nRF_RX_Power_Up();
		set_first_time_into_RX_MODE_after_TX_MODE = 0;
	}
	if ( RX_flag )			// if RX_flag == 1 then: - je¿eli zmienna RX_flag == 1 to:
	{
		CE_LOW;
		uint8_t fifo_status; //variable which stores FIFO_STATUS register value
		uint8_t len;         //variable which stores length of recived payload
		uint8_t i;           //index variable for loop
		uint8_t * wsk;       //pointer for first byte of reciver buffer nRF_RX_buffer
		RX_flag = 0;         //reset the RX_flag

		//do...while loop. this loop executes until RX_FIFO is empty

		do
		{
			wsk = nRF_RX_bufffer;        				//wsk equals to addres of first byte nRF_RX_bufffer
			CSN_LOW;                     				//chip select low
			SPI_WriteByte(R_RX_PL_WID);  				//send: read length of payload command
			len = SPI_WriteReadByte(NOP);				//read length
			CSN_HIGH;                    				//chip select high
			if ( len > MAXIMUM_PAYLOAD_SIZE ) break;       				//if len is bigger than maximum payload size then break
			CSN_LOW;                    				//chip select low
			SPI_WriteByte( R_RX_PAYLOAD ); //read payload command
			i = len;
			while(i--)   //read data until len == 0
			{
				*wsk++ = SPI_WriteReadByte(NOP);
			}
			CSN_HIGH;                    //csn goes high - csn stan wysoki
			fifo_status = nRF_Read_One_Byte_From_Register(FIFO_STATUS); //read FIFO_STATUS register
			if ( len &&  nRF_RX_Event_Callback ) ( * nRF_RX_Event_Callback )( nRF_RX_bufffer, len ); //if callback function is registered and len is bigger	 //than 0 send recived data to your callback function
		}
		while ( !( fifo_status & (1<<RX_EMPTY) ));  //if RX_EMPTY bit is LOW then loop must execute.,

