Lavaro33/Nixie-clock/37_METEO_RX_ATmega88/nRF24L01/nRF24L01.c
		CSN_LOW;
		uint8_t status = SPI_WriteReadByte(NOP);
		CSN_HIGH;
		status |= (1<<RX_DR);							//reset intterupt bit on status variable
		nRF_Config_Register(STATUS, status);			//save status variable in STATUS register
		CE_HIGH;
	}
}



//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// INITIALIAZE NRF function
//........................................................................................................................

void nRF_init( void )
{

	init_SPI(); //initialize SPI (software or hardware, you must choose it in SPI.h file)

	#if USE_IRQ == 1
	Initialize_INTERRUPT_For_nRF(); //initialize INTx or PCINTx interrupt for nRF, you must do it on your Own
	#endif

	nRF_SET_Transmitter_Adres(PSTR("ATNEL"));		//set transmitter addres
	nRF_SET_Reciver_Addres(RX_ADDR_P0, PSTR("ATNEL"));						//set reciving addres for datapipe0
	nRF_Config_Register( CONFIG, nRF24L01_CONFIG);         					//Write interrupt masks nRF_CONFIG to CONGIG register of nRF
	nRF_Clear_RX();                                       				    //Clear RX FIFO
	nRF_Clear_TX();                                        				    //Clear TX FIFO
	nRF_Set_State_And_Width_Of_CRC( ONE_BYTE , ON );        			    //ON == Enable CRC; OFF == disable CRC, ONE_BYTE or TWO_BYTES - width of CRC;
	nRF_Set_Channel(10);                                   				    //Set channel number
    nRF_Set_Active_DataPipe_And_ACK ( ERX_P0, ON, ACK_ON );					//Set which datapipe state you want to change, in this case datapipe = 0 (ERX_P0), ON - means enable this datapipe, ACK_ON means to enable ACK for choosen data pipe.
	nRF_Set_Retransmission_Time_And_Ammount(WAIT_4000uS , RETR_15_TIMES );  //set time between retransmissions and ammount of retranssmisions
	nRF_Set_Data_Speed_And_Reciver_Power(TRANS_SPEED_1MB, RF_PWR_0dB );     //Set transmision speed and reciver power
	nRF_Set_Dynamic_Payload_State_On_Data_Pipe( DPL_P0 , ON );              //Enable dynamic payload of choosen datapipe


	RX_flag = 1;		//Clear RX flag
	TX_flag = 0;        //Clear TX flag

	nRF_Config_Register(STATUS, (1<<TX_DS) | (1<<RX_DR) | (1<<MAX_RT));    //Clear interrupt bits in STATUS register

}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to read one byte from register given as attribute of the function
//........................................................................................................................
uint8_t nRF_Read_One_Byte_From_Register(uint8_t register_name)
{
	uint8_t data;       											//temporary variable data is used to store and return value of choosen register
	CSN_LOW;                                                        //chip select low
	SPI_WriteByte( R_REGISTER | (REGISTER_MASK & register_name) );  //send R_REGISTER command with number of choosen register (SEE nRF24L01_memory_map.h)
	data = SPI_WriteReadByte(NOP);                                  //write to "data", value from choosen register
	CSN_HIGH;                                                       //chip select high
	return data;                                                    //return data
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to write data to the choosen register
//........................................................................................................................
void nRF_Config_Register(uint8_t register_name, uint8_t value)
{
	CSN_LOW;														//make CSN low
	SPI_WriteByte( W_REGISTER | (REGISTER_MASK & register_name) );  //send information to nRF which register you want to write
	SPI_WriteByte( value );                                         //send value that you want write to this register
	CSN_HIGH;                                                       //make CSN high
}


//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to read data from the choosen register to buffer
//........................................................................................................................
void nRF_Read_Registers( uint8_t register_name, uint8_t * buffer_for_registers_content, uint8_t length_of_content )
{
	CSN_LOW;																								 	//make CSN low
	SPI_WriteByte( R_REGISTER | ( REGISTER_MASK & register_name ) );										 	//send information to nRF which register you want to read
	SPI_WriteReadDataBuffer( buffer_for_registers_content, buffer_for_registers_content, length_of_content );	//read from nRF given ammount of bytes to the buffer
	CSN_HIGH;       																						 	//make CSN high
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to write data from the buffer to the choosen register
//........................................................................................................................
void nRF_Write_Register( uint8_t register_name, uint8_t * buffer_for_registers_content, uint8_t length_of_content )
{
	CSN_LOW;																									//make CSN low
	SPI_WriteByte( W_REGISTER | ( REGISTER_MASK & register_name ) );								//send information to nRF which register you want to write
	SPI_WriteReadDataBuffer( buffer_for_registers_content, buffer_for_registers_content, length_of_content );	//write to nRF given ammount of bytes from the buffer
	CSN_HIGH;																									//make CSN low
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set transmitter addres.
//........................................................................................................................
void nRF_SET_Transmitter_Adres(const char * addres)
{
	char TX_addres[TX_ADDRES_LENGTH];														//declaration of TX_addres temporary buffer
	for(uint8_t i = 0; i < TX_ADDRES_LENGTH; i++ )                                          //until i is smaller than TX_ADDRES LENGTH copy data from flash to temporary TX_addres buffer
	{
		TX_addres[i] = pgm_read_byte(addres++);
	}
	if( TX_ADDRES_LENGTH > 5 ) nRF_Write_Register(TX_ADDR, (uint8_t *) TX_addres, 5);		//if TX_ADDRES_LENGTH is bigger than 5 bytes send only 5 bytes
	else if( TX_ADDRES_LENGTH < 3 ) nRF_Write_Register(TX_ADDR, (uint8_t *) TX_addres, 3);  //if TX_ADDRES_LENGTH is smaller than 3 bytes send 3 bytes
	else nRF_Write_Register(TX_ADDR, (uint8_t *) TX_addres , TX_ADDRES_LENGTH);             //else send given by attribute ammount of bytes

