Lavaro33/Nixie-clock/37_METEO_RX_ATmega88/nRF24L01/nRF24L01.c
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set transmitter addres.
//........................................................................................................................
void nRF_SET_Reciver_Addres( uint8_t data_pipe, const char * addres )
{
	char RX_addres[RX_ADDRES_LENGTH];														//declaration of RX_addres temporary buffer

	if( data_pipe > RX_ADDR_P5 ) data_pipe = RX_ADDR_P0; 								    //this is a protection. When given by data_pipe variable register addres is smaller
	else if( data_pipe < RX_ADDR_P0 ) data_pipe = RX_ADDR_P0;								// or bigger than possible value, this condition is setting deffault value
	else if( data_pipe > RX_ADDR_P5 ) data_pipe = RX_ADDR_P5;

	if ( data_pipe < RX_ADDR_P2 )															// data_pipe ix equal to RX_ADDR_P0 or RX_ADDR_P1 write 5 bytes of addres to nRF
	{
		for(uint8_t i = 0; i < RX_ADDRES_LENGTH; i++ )
		{
		RX_addres[i] = pgm_read_byte(addres++);
		}

		if( RX_ADDRES_LENGTH > 5 ) nRF_Write_Register(data_pipe, (uint8_t*)RX_addres, 5);
		else if( RX_ADDRES_LENGTH < 3 ) nRF_Write_Register(data_pipe, (uint8_t*) RX_addres, 3);
		else nRF_Write_Register(data_pipe, (uint8_t *) RX_addres, RX_ADDRES_LENGTH);
	}
	else																					//else send only one byte of addres because first four bytes are the same as the RX_ADDR_P1 first four bytes of addres.
	{
		RX_addres[0] = pgm_read_byte(addres);
		nRF_Config_Register(data_pipe, RX_addres[0]);
	}

}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to chcecking RX_DR bit in STATUS register. When this bit is HIGH that means tha data are ready
// function used in pooling mode
//........................................................................................................................
uint8_t nRF_Data_Ready(void)
{
	CSN_LOW;									//make CSN low
	uint8_t data = SPI_WriteReadByte(NOP);		//send to nRF dummy byte and read STATUS register
	CSN_HIGH;									//make CSN high
	return (data & (1<<RX_DR));					//return 0 if data not ready or 1 if data ready
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set state and width of CRC. First attrbiute of this function is ONE_BYTE or TWO_BYTES,
// second attribute is ON or OFF
//........................................................................................................................
void nRF_Set_State_And_Width_Of_CRC( uint8_t one_or_two_bytes , uint8_t on_or_off)
{
	uint8_t config = nRF_Read_One_Byte_From_Register(CONFIG);				//read data from congig register and save it to config variable

	if ( one_or_two_bytes == ONE_BYTE ) config &= ~(1<<CRCO);				//if first given attribute is ONE_BYTE clear CRCO bit
	else if ( one_or_two_bytes == TWO_BYTES ) config |= (1<<CRCO);			//else if first given attribute is TWO_BYTES set CRCO bit
	else config &= ~(1<<CRCO);												//else given attribute is diffrent set CRCO low

	if (on_or_off == ON)   config |= (1<<EN_CRC);							//if second attribute is equal to ON, set EN_CRC bit
	else if ( on_or_off == OFF )  config &= ~(1<<EN_CRC);					//esle reset the EN_CRC bit

	nRF_Config_Register(CONFIG, config);									//write config content to CONFIG register
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to switch nRF into TX mode
//........................................................................................................................
void nRF_TX_Power_Up(void)
{
	CE_LOW;																	//make CE low
	uint8_t config;															//declaration of temporary variable
	config = nRF_Read_One_Byte_From_Register(CONFIG);						//save copy of config regster in config variable
	config &= ~(1<<PRIM_RX);												//reset PRIM_RX bit
	config |= (1<<PWR_UP);													//set PWR_UP bit
	nRF_Config_Register( CONFIG , config);									//write config variable to CONGIG register																//make CE high
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to switch nRF into RX mode
//........................................................................................................................
void nRF_RX_Power_Up(void)
{
	CE_LOW;																	//make CE_LOW
	uint8_t config;															//declaration of config variable
	config = nRF_Read_One_Byte_From_Register(CONFIG);						//save copy of CONFIG register to config variable
	nRF_Config_Register(CONFIG , config | (1<<PWR_UP) | (1<<PRIM_RX) );		//set PWR_UP and PRIM_RX bits in config variable ande save it in nRF CONFIG register
	CE_HIGH;																//make CE_HIGH
	_delay_us(130);
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to switch nRF into POWER DOWN mode
//........................................................................................................................
void nRF_Power_Down(void)
{
	CE_LOW;																	//make CE_LOW
	uint8_t config;															//declaration of config variable
	config = nRF_Read_One_Byte_From_Register(CONFIG);						//save copy of CONFIG register to config variable
	config &= ~((1<<PWR_UP) | (1<<PRIM_RX));								//reset PWR_UP and PRIM_RX bits
	nRF_Config_Register(CONFIG , config );									//save congig variable in CONFIG register
	nRF_Clear_RX();															//clear RX fifo
	nRF_Clear_TX();															//clear TX fifo
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set transmission channel
//........................................................................................................................
void nRF_Set_Channel( uint8_t channel )
{
	nRF_Config_Register( RF_CH ,  0x7F & channel );							//save to nRF RF_CH register channel number (0x7f == 0b01111111 is the mask)
}

