Lavaro33/Nixie-clock/37_METEO_RX_ATmega88/nRF24L01/nRF24L01.c
//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to clear TX fifo
//........................................................................................................................
void nRF_Clear_TX (void)
{
	CSN_LOW;							//make CSN low
	SPI_WriteByte( FLUSH_TX );			//send to nRF FLUSH_TX command what means CLEAR TX FIFO
	CSN_HIGH;							//make CSN high
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to clear RX fifo
//........................................................................................................................
void nRF_Clear_RX (void)
{
	CSN_LOW;							//make CSN low
	SPI_WriteByte( FLUSH_RX );			//send to nRF FLUSH_RX command what means CLEAR RX FIFO
	CSN_HIGH;							//make CSN high
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set states of datapipes
// first attribute is DataPipe, you must put here name of datapipe tha you want to enable, this name is ERX_Px where x is number of data pipe (see nRF_Init function)
// second attribute is or_on_off, here you put ON or OFF macro. When you put here ON, the choosen data pipe will be turned ON, if put here OFF, datapipe will be turned off
// third and last parameter is ACK_on_or_off, you must put here macros: ACK_ON or ACK_OFF. This parameter turns ACK_ON or turns ACK_OFF
//........................................................................................................................
void nRF_Set_Active_DataPipe_And_ACK (uint8_t DataPipe, uint8_t on_or_off, uint8_t ACK_on_or_off )
{
	uint8_t data = nRF_Read_One_Byte_From_Register(EN_RXADDR);		//read data from EN_RXADDR register save it in data variable

	if(on_or_off == ON) data |= (DataPipe);							//if second attribute is ON, set bit ERX_Px (given by DataPipe parameter)
	else if (on_or_off == OFF) data &= ~(DataPipe);					//else reset this bit

	nRF_Config_Register( EN_RXADDR, data );							//save data variable to EN_RXADDR register

	data = nRF_Read_One_Byte_From_Register(EN__AA);					//read data from EN_AA register and save it in data variable

	if(ACK_on_or_off == ACK_ON) data |= (DataPipe);					//if third parameter is ACK_ON, enable auto ackonwledgements by setting ENAA_Px bit (this same value as ERX_Px)
	else if (ACK_on_or_off == ACK_OFF) data &= ~(DataPipe);			//else turn off auto acknowledgments

	nRF_Config_Register( EN__AA, data );							//save the variable data to EN__AA register
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to send data to another nRF's
// attribute to this function is the pointer to the first byte of transsmision buffer
//........................................................................................................................
void nRF_SendDataToAir( char * data )
{
	if(TX_flag == 1) return;								//if still is in transmitting mode or function isn't used for the first time, return
	TX_flag = 1;											//set TX mode flag to one
	char * wsk = data;										//wsk pointer is equal to the addres of first byte transmission buffer
	uint8_t length;											//declare length variable
	if(disable_dynamic_payload == 1) length = payload_width;//if nRF_Set_PAYLOAD_Width() was used use the length variable is equal to width parameter of tha function
	else length = strlen ( data );						//else length is equal to the size of transmission buffer

	if ( length >= MAXIMUM_PAYLOAD_SIZE ) length = 31;

	nRF_TX_Power_Up();										//turn on transmission mode
	_delay_us(150);
	CSN_LOW;												//make CSN low
	SPI_WriteByte(W_TX_PAYLOAD);							//send to nRF W_TX_PAYLOAD command what means "Write data to TX FIFO"
	while(length--)
	{
		SPI_WriteByte(*wsk++);
	}
	SPI_WriteByte(0);
	CSN_HIGH;												//CSN high
	CE_HIGH;												//start transmision!
	#if USE_IRQ == 0

	uint8_t data1 = 0;

	do
	{
		CSN_LOW;											//make CSN low
		data1 = SPI_WriteReadByte(NOP);						//send to nRF dummy byte and read STATUS register
		CSN_HIGH;											//make CSN high
	}while(!(( data1 & (1<<TX_DS))||( data1 & (1<<MAX_RT))));



	if ( ( data1 & (1<<MAX_RT) ) )							//if maximum ammount of retransmissions is achived,
	{
		CE_LOW;													//make CE low												//clear TX FIFO
		nRF_Config_Register(STATUS, data1 | (1<<MAX_RT) | (1<<TX_DS) );	//reset TX_DS and MAX_RT intterrupt flags in STATUS register
		nRF_Clear_TX();
		set_first_time_into_RX_MODE_after_TX_MODE = 1;
		TX_flag = 0;
	}
															//else if was send or funcion is used for the first time
	if ( ( data1 & (1<<TX_DS)) )
	{
		CE_LOW;
		set_first_time_into_RX_MODE_after_TX_MODE = 1;
		TX_flag = 0;										//TX flag = 0
		nRF_Config_Register(STATUS, data1 | (1<<TX_DS));		//clear TX_DS int flag
	}

	#endif
}
//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set payload width
// first attribute of this function is number or RX payload (RX_PW_Px), second one is the width(1-32 bytes)
// use this function only if the dyanmic payloads are turned off
//........................................................................................................................
void nRF_Set_PAYLOAD_Width ( uint8_t payload, uint8_t width )
{
	nRF_Config_Register( payload, ( 0x1F & width ) );		//config RX_PW_Px with number of bytes
	disable_dynamic_payload = 1;							//set the disable_dynamic_payload flag
	payload_width = width;									//global variable payload_width is equal to width given by attribute
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to number of retransmissions and time beetwen each retransmission
// first attribute is WAIT_XXXX_uS and the second is RETR_X_TIMES (see nRF_memory_map.h)
//........................................................................................................................
void nRF_Set_Retransmission_Time_And_Ammount (uint8_t time, uint8_t ammount)
{
	nRF_Config_Register( SETUP_RETR, ( time | ammount ) );		//write to SETUP_RETR register number of retransmisions and time beetwen them
}

