Lavaro33/Nixie-clock/37_METEO_RX_ATmega88/nRF24L01/nRF24L01.c
//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set transmission speed and receiver power
// first attribute is TRANS_SPEED_x and the second is RF_PWR_x (see nRF_memory_map.h)
//........................................................................................................................
void nRF_Set_Data_Speed_And_Reciver_Power(uint8_t Data_rate, uint8_t power)
{
	nRF_Config_Register( RF_SETUP, ( Data_rate | power ));	 	//write to RF_SETUP register transmision speed and and receiver power
}

//''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// function used to set dynamic payloads
// first attribute is DPL_Px (number of receiver payload) and the second is ON or OFF(see nRF_memory_map.h)
//........................................................................................................................
void nRF_Set_Dynamic_Payload_State_On_Data_Pipe(uint8_t data_pipe_number, uint8_t on_off )
{
	nRF_Config_Register( DYNPD, data_pipe_number );					//save DPL_Px value to DYNPD register
	uint8_t feature = nRF_Read_One_Byte_From_Register(FEATURE);		//make copy of FEATURE register

	if (on_off == ON)	feature |= (1<<EN_DPL);		//if second attribute is equal to ON
														//set bit EN_DPL
	if (on_off == OFF)	feature &= ~(1<<EN_DPL);	//if second attribute is equal to OFF
														//reset bit EN_DPL
	nRF_Config_Register(FEATURE, feature);			//save feature variable to FEATURE register
}


#if USE_IRQ == 1
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''//
//         IRQ INTERRUPT HANDLER section					                   //
//.............................................................................//

//in this function you must put your initialization of external intterup (INTx or PCINTx)
//if you don't use interrupts there is no matter what code is here

void Initialize_INTERRUPT_For_nRF(void)
{
#if ( defined (__AVR_ATmega32__) || defined (__AVR_ATmega16__) )
	GICR   |= (1<<INT2);              //enable INT2 intterupt source in GICR register
	MCUCSR |= (0<<ISC2);              //set intterupt active on falling edge

#elif ( defined(__AVR_ATmega328P__) || defined(__AVR_ATmega88P__) || defined(__AVR_ATmega168P__))
	EIMSK   |= (1<<INT0);              //enable INT0 intterupt source in EIMSK register
	EICRA |= (1<<ISC01);              //set intterupt active on falling edge
#endif

}

//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
// Here is external intterupt handler, if you are using interupts change the name of the vector interrupt ore live the same if you are using the same
//...................................................................................................................................................
ISR(INT0_vect)
{
	CSN_LOW;											//Chip select LOW
	register uint8_t status = SPI_WriteReadByte(NOP);	//read STATUS register value
	CSN_HIGH;											//chip select high

	if ( (status & (1<<RX_DR)) )						//id data recived
	{
		RX_flag = 1;									//RX flag equals to 1
	}

	if ( status & (1<<TX_DS) )							//if data was send
	{
		status |= (1<<TX_DS);							//clear TX_DS bit in status variable
		nRF_Config_Register( STATUS, status );			//save status variable in STATUS register
		TX_flag = 0;									//TX_flag = 0
		set_first_time_into_RX_MODE_after_TX_MODE = 1;
		CE_LOW;
	}

	if ( status & (1<<MAX_RT) )							//id max of retransmissions was achived
	{
		status |= (1<<MAX_RT) | (1<<TX_DS);				//clear MAX_RT and TX_DS bits in status variable
		nRF_Config_Register( STATUS, status );			//save variable status to the STATUS register
		TX_flag = 0;									//clear TX_flag
		set_first_time_into_RX_MODE_after_TX_MODE = 1;
		nRF_Clear_TX();
		CE_LOW;
	}
}

#endif













